app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-06-12 03:23:14.063252"], ["updated_at", "2018-06-12 03:23:14.063252"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-06-12 03:23:14.071197"], ["updated_at", "2018-06-12 03:23:14.071197"]]
---
  def upload
    CSV.foreach(params[:leads].path, headers: true) do |lead|
      Artist.create(title: song[0], artist_name: song[1])